package io.github.kloping.qqbot.entities.qqpd.data;

import com.alibaba.fastjson.annotation.JSONField;

/**
 * <table><thead><tr><th>字段名</th> <th>类型</th> <th>描述</th></tr></thead> <tbody><tr><td>id</td> <td>string</td> <td>表情ID，系统表情使用数字为ID，emoji使用emoji本身为id，参考 Emoji 列表</td></tr> <tr><td>type</td> <td>uint32</td> <td>表情类型 EmojiType</td></tr></tbody></table>
 *
 * @author github.kloping
 */
public enum Emoji {
    得意(1, "4", "得意"),
    流泪(1, "5", "流泪"),
    睡(1, "8", "睡"),
    大哭(1, "9", "大哭"),
    尴尬(1, "10", "尴尬"),
    调皮(1, "12", "调皮"),
    微笑(1, "14", "微笑"),
    酷(1, "16", "酷"),
    可爱(1, "21", "可爱"),
    傲慢(1, "23", "傲慢"),
    饥饿(1, "24", "饥饿"),
    困(1, "25", "困"),
    惊恐(1, "26", "惊恐"),
    流汗(1, "27", "流汗"),
    憨笑(1, "28", "憨笑"),
    悠闲(1, "29", "悠闲"),
    奋斗(1, "30", "奋斗"),
    疑问(1, "32", "疑问"),
    嘘(1, "33", "嘘"),
    晕(1, "34", "晕"),
    敲打(1, "38", "敲打"),
    再见(1, "39", "再见"),
    发抖(1, "41", "发抖"),
    爱情(1, "42", "爱情"),
    跳跳(1, "43", "跳跳"),
    拥抱(1, "49", "拥抱"),
    蛋糕(1, "53", "蛋糕"),
    咖啡(1, "60", "咖啡"),
    玫瑰(1, "63", "玫瑰"),
    爱心(1, "66", "爱心"),
    太阳(1, "74", "太阳"),
    月亮(1, "75", "月亮"),
    赞(1, "76", "赞"),
    握手(1, "78", "握手"),
    胜利(1, "79", "胜利"),
    飞吻(1, "85", "飞吻"),
    西瓜(1, "89", "西瓜"),
    冷汗(1, "96", "冷汗"),
    擦汗(1, "97", "擦汗"),
    抠鼻(1, "98", "抠鼻"),
    鼓掌(1, "99", "鼓掌"),
    糗大了(1, "100", "糗大了"),
    坏笑(1, "101", "坏笑"),
    左哼哼(1, "102", "左哼哼"),
    右哼哼(1, "103", "右哼哼"),
    哈欠(1, "104", "哈欠"),
    委屈(1, "106", "委屈"),
    左亲亲(1, "109", "左亲亲"),
    可怜(1, "111", "可怜"),
    示爱(1, "116", "示爱"),
    抱拳(1, "118", "抱拳"),
    拳头(1, "120", "拳头"),
    爱你(1, "122", "爱你"),
    NO(1, "123", "NO"),
    OK(1, "124", "OK"),
    转圈(1, "125", "转圈"),
    挥手(1, "129", "挥手"),
    喝彩(1, "144", "喝彩"),
    棒棒糖(1, "147", "棒棒糖"),
    茶(1, "171", "茶"),
    泪奔(1, "173", "泪奔"),
    无奈(1, "174", "无奈"),
    卖萌(1, "175", "卖萌"),
    小纠结(1, "176", "小纠结"),
    doge(1, "179", "doge"),
    惊喜(1, "180", "惊喜"),
    骚扰(1, "181", "骚扰"),
    笑哭(1, "182", "笑哭"),
    我最美(1, "183", "我最美"),
    点赞(1, "201", "点赞"),
    托脸(1, "203", "托脸"),
    托腮(1, "212", "托腮"),
    啵啵(1, "214", "啵啵"),
    蹭一蹭(1, "219", "蹭一蹭"),
    抱抱(1, "222", "抱抱"),
    拍手(1, "227", "拍手"),
    佛系(1, "232", "佛系"),
    喷脸(1, "240", "喷脸"),
    甩头(1, "243", "甩头"),
    加油抱抱(1, "246", "加油抱抱"),
    脑阔疼(1, "262", "脑阔疼"),
    捂脸(1, "264", "捂脸"),
    辣眼睛(1, "265", "辣眼睛"),
    哦哟(1, "266", "哦哟"),
    头秃(1, "267", "头秃"),
    问号脸(1, "268", "问号脸"),
    暗中观察(1, "269", "暗中观察"),
    emm(1, "270", "emm"),
    吃瓜(1, "271", "吃瓜"),
    呵呵哒(1, "272", "呵呵哒"),
    我酸了(1, "273", "我酸了"),
    汪汪(1, "277", "汪汪"),
    汗(1, "278", "汗"),
    无眼笑(1, "281", "无眼笑"),
    敬礼(1, "282", "敬礼"),
    面无表情(1, "284", "面无表情"),
    摸鱼(1, "285", "摸鱼"),
    哦(1, "287", "哦"),
    睁眼(1, "289", "睁眼"),
    敲开心(1, "290", "敲开心"),
    摸锦鲤(1, "293", "摸锦鲤"),
    期待(1, "294", "期待"),
    拜谢(1, "297", "拜谢"),
    元宝(1, "298", "元宝"),
    牛啊(1, "299", "牛啊"),
    右亲亲(1, "305", "右亲亲"),
    牛气冲天(1, "306", "牛气冲天"),
    喵喵(1, "307", "喵喵"),
    仔细分析(1, "314", "仔细分析"),
    加油(1, "315", "加油"),
    崇拜(1, "318", "崇拜"),
    比心(1, "319", "比心"),
    庆祝(1, "320", "庆祝"),
    拒绝(1, "322", "拒绝"),
    吃糖(1, "324", "吃糖"),
    生气(1, "326", "生气"),
    晴天(2, "9728", "☀ 晴天"),
    咖啡2(2, "9749", "☕ 咖啡"),
    可爱2(2, "9786", "☺ 可爱"),
    闪光(2, "10024", "✨ 闪光"),
    错误(2, "10060", "❌ 错误"),
    问号(2, "10068", "❔ 问号"),
    玫瑰2(2, "127801", "🌹 玫瑰"),
    西瓜2(2, "127817", "🍉 西瓜"),
    苹果(2, "127822", "🍎 苹果"),
    草莓(2, "127827", "🍓 草莓"),
    拉面(2, "127836", "🍜 拉面"),
    面包(2, "127838", "🍞 面包"),
    刨冰(2, "127847", "🍧 刨冰"),
    啤酒(2, "127866", "🍺 啤酒"),
    干杯(2, "127867", "🍻 干杯"),
    庆祝2(2, "127881", "🎉 庆祝"),
    虫(2, "128027", "🐛 虫"),
    牛(2, "128046", "🐮 牛"),
    鲸鱼(2, "128051", "🐳 鲸鱼"),
    猴(2, "128053", "🐵 猴"),
    拳头2(2, "128074", "👊 拳头"),
    好的(2, "128076", "👌 好的"),
    厉害(2, "128077", "👍 厉害"),
    鼓掌2(2, "128079", "👏 鼓掌"),
    内衣(2, "128089", "👙 内衣"),
    男孩(2, "128102", "👦 男孩"),
    爸爸(2, "128104", "👨 爸爸"),
    爱心2(2, "128147", "💓 爱心"),
    礼物(2, "128157", "💝 礼物"),
    睡觉(2, "128164", "💤 睡觉"),
    水(2, "128166", "💦 水"),
    吹气(2, "128168", "💨 吹气"),
    肌肉(2, "128170", "💪 肌肉"),
    邮箱(2, "128235", "📫 邮箱"),
    火(2, "128293", "🔥 火"),
    呲牙(2, "128513", "😁 呲牙"),
    激动(2, "128514", "😂 激动"),
    高兴(2, "128516", "😄 高兴"),
    嘿嘿(2, "128522", "😊 嘿嘿"),
    羞涩(2, "128524", "😌 羞涩"),
    哼哼(2, "128527", "😏 哼哼"),
    不屑(2, "128530", "😒 不屑"),
    汗2(2, "128531", "😓 汗"),
    失落(2, "128532", "😔 失落"),
    飞吻2(2, "128536", "😘 飞吻"),
    亲亲(2, "128538", "😚 亲亲"),
    淘气(2, "128540", "😜 淘气"),
    吐舌(2, "128541", "😝 吐舌"),
    大哭2(2, "128557", "😭 大哭"),
    紧张(2, "128560", "😰 紧张"),
    瞪眼(2, "128563", "😳 瞪眼"),
    ;
    private String id;
    /**
     * <table><thead><tr><th>值</th> <th>描述</th></tr></thead> <tbody><tr><td>1</td> <td>系统表情</td></tr> <tr><td>2</td> <td>emoji表情</td></tr></tbody></table>
     */
    private Integer type;

    /**
     * 不存在
     */
    @JSONField(serialize = false, deserialize = false)
    private String text;

    Emoji(Integer type, String id, String text) {
        this.id = id;
        this.type = type;
        this.text = text;
    }

    public String getId() {
        return id;
    }

    public void setId(String id) {
        this.id = id;
    }

    public Integer getType() {
        return type;
    }

    public void setType(Integer type) {
        this.type = type;
    }

    public String getText() {
        return text;
    }

    public void setText(String text) {
        this.text = text;
    }

    public static Emoji valueOf(Integer type, String id) {
        for (Emoji value : Emoji.values()) {
            if (value.type == type && value.id.equals(id))
                return value;
        }
        return null;
    }
}
